[Timeout] ArrayDeclaration
hfo_hot_obsidian/silver/2_areas/omega_core.ts:30:24
     read() {
         return {
             id: 0,
-            landmarks: Array(21).fill({ x: 0.5, y: 0.5, z: 0 }),
+            landmarks: Array().fill({ x: 0.5, y: 0.5, z: 0 }),
             handedness: 'Right'
         };

[Timeout] ObjectLiteral
hfo_hot_obsidian/silver/2_areas/omega_core.ts:30:39
     read() {
         return {
             id: 0,
-            landmarks: Array(21).fill({ x: 0.5, y: 0.5, z: 0 }),
+            landmarks: Array(21).fill({}),
             handedness: 'Right'
         };

[Timeout] StringLiteral
hfo_hot_obsidian/silver/2_areas/omega_core.ts:31:25
         return {
             id: 0,
             landmarks: Array(21).fill({ x: 0.5, y: 0.5, z: 0 }),
-            handedness: 'Right'
+            handedness: ""
         };
     }

[Timeout] ObjectLiteral
hfo_hot_obsidian/silver/2_areas/omega_core.ts:42:50
         try {
             const validatedHand = P1_HandLandmarksContract.parse(rawSensingData);
             const indexTip = validatedHand.landmarks[8];
-            return P1_PhysicsInputContract.parse({
-                x: indexTip.x * config.width,
-                y: indexTip.y * config.height,
-                intent: 'POINTER_READY'
-            });
+            return P1_PhysicsInputContract.parse({});
         } catch (err) {
             return null;

[Timeout] ArithmeticOperator
hfo_hot_obsidian/silver/2_areas/omega_core.ts:43:20
             const validatedHand = P1_HandLandmarksContract.parse(rawSensingData);
             const indexTip = validatedHand.landmarks[8];
             return P1_PhysicsInputContract.parse({
-                x: indexTip.x * config.width,
+                x: indexTip.x / config.width,
                 y: indexTip.y * config.height,
                 intent: 'POINTER_READY'

[Killed] ArithmeticOperator
hfo_hot_obsidian/silver/2_areas/omega_core.ts:44:20
             const indexTip = validatedHand.landmarks[8];
             return P1_PhysicsInputContract.parse({
                 x: indexTip.x * config.width,
-                y: indexTip.y * config.height,
+                y: indexTip.y / config.height,
                 intent: 'POINTER_READY'
             });
killedBy: All tests
statusReason: Running 9 tests using 1 worker



  ✓  1 hfo_hot_obsidian/silver/2_areas/omega_core.test.ts:8:9 › Omega Silver Core Mutation Tests › P1_HandLandmarksContract should validate correct data (36ms)

  ✓  2 hfo_hot_obsidian/silver/2_areas/omega_core.test.ts:20:9 › Omega Silver Core Mutation Tests › P1_HandLandmarksContract should use Right as default handedness (16ms)

[Timeout] BlockStatement
hfo_hot_obsidian/silver/2_areas/omega_core.ts:47:23
                 y: indexTip.y * config.height,
                 intent: 'POINTER_READY'
             });
-        } catch (err) {
-            return null;
-        }
+        } catch (err) {}
     }
 };

[Killed] ArithmeticOperator
hfo_hot_obsidian/silver/2_areas/omega_core.ts:59:16
 export const P2_SHAPE = {
     calculateForce(cursorPos: { x: number, y: number }, targetPos: { x: number, y: number }) {
         return {
-            x: (targetPos.x - cursorPos.x) * 0.005,
+            x: (targetPos.x - cursorPos.x) / 0.005,
             y: (targetPos.y - cursorPos.y) * 0.005
         };
killedBy: All tests
statusReason: Running 9 tests using 1 worker


  ✓  1 hfo_hot_obsidian/silver/2_areas/omega_core.test.ts:8:9 › Omega Silver Core Mutation Tests › P1_HandLandmarksContract should validate correct data (62ms)

  ✓  2 hfo_hot_obsidian/silver/2_areas/omega_core.test.ts:20:9 › Omega Silver Core Mutation Tests › P1_HandLandmarksContract should use Right as default handedness (18ms)

  ✓  3 hfo_hot_obsidian/silver/2_a

[Killed] ArithmeticOperator
hfo_hot_obsidian/silver/2_areas/omega_core.ts:59:17
 export const P2_SHAPE = {
     calculateForce(cursorPos: { x: number, y: number }, targetPos: { x: number, y: number }) {
         return {
-            x: (targetPos.x - cursorPos.x) * 0.005,
+            x: (targetPos.x + cursorPos.x) * 0.005,
             y: (targetPos.y - cursorPos.y) * 0.005
         };
killedBy: All tests
statusReason: Running 9 tests using 1 worker



  ✓  1 hfo_hot_obsidian/silver/2_areas/omega_core.test.ts:8:9 › Omega Silver Core Mutation Tests › P1_HandLandmarksContract should validate correct data (68ms)

  ✓  2 hfo_hot_obsidian/silver/2_areas/omega_core.test.ts:20:9 › Omega Silver Core Mutation Tests › P1_HandLandmarksContract should use Right as default handedness (40ms)

[Killed] ArithmeticOperator
hfo_hot_obsidian/silver/2_areas/omega_core.ts:60:17
     calculateForce(cursorPos: { x: number, y: number }, targetPos: { x: number, y: number }) {
         return {
             x: (targetPos.x - cursorPos.x) * 0.005,
-            y: (targetPos.y - cursorPos.y) * 0.005
+            y: (targetPos.y + cursorPos.y) * 0.005
         };
     }
killedBy: All tests
statusReason: Running 9 tests using 1 worker



  ✓  1 hfo_hot_obsidian/silver/2_areas/omega_core.test.ts:8:9 › Omega Silver Core Mutation Tests › P1_HandLandmarksContract should validate correct data (92ms)

  ✓  2 hfo_hot_obsidian/silver/2_areas/omega_core.test.ts:20:9 › Omega Silver Core Mutation Tests › P1_HandLandmarksContract should use Right as default handedness (14ms)

[Killed] ArithmeticOperator
hfo_hot_obsidian/silver/2_areas/omega_core.ts:60:16
     calculateForce(cursorPos: { x: number, y: number }, targetPos: { x: number, y: number }) {
         return {
             x: (targetPos.x - cursorPos.x) * 0.005,
-            y: (targetPos.y - cursorPos.y) * 0.005
+            y: (targetPos.y - cursorPos.y) / 0.005
         };
     }
killedBy: All tests
statusReason: Running 9 tests using 1 worker



  ✓  1 hfo_hot_obsidian/silver/2_areas/omega_core.test.ts:8:9 › Omega Silver Core Mutation Tests › P1_HandLandmarksContract should validate correct data (38ms)

  ✓  2 hfo_hot_obsidian/silver/2_areas/omega_core.test.ts:20:9 › Omega Silver Core Mutation Tests › P1_HandLandmarksContract should use Right as default handedness (16ms)
