[Timeout] ArithmeticOperator
2_areas/mission_thread_omega/lib/math_utils.ts:11:12
 }
 
 export function multiply(a: number, b: number): number {
-    return a * b;
+    return a / b;
 }
 

[Timeout] EqualityOperator
2_areas/mission_thread_omega/lib/math_utils.ts:15:9
 }
 
 export function divide(a: number, b: number): number {
-    if (b === 0) {
+    if (b !== 0) {
         throw new Error("Division by zero");
     }

[Timeout] ConditionalExpression
2_areas/mission_thread_omega/lib/math_utils.ts:15:9
 }
 
 export function divide(a: number, b: number): number {
-    if (b === 0) {
+    if (true) {
         throw new Error("Division by zero");
     }
